# greyvbss
# cilik-userbot


from pyAyiin import cmdHelp
from pyAyiin.decorator import ayiinCmd

from . import cmd


@ayiinCmd(pattern="skull(?: |$)(.*)")
async def _(event):
    await event.edit("███████████████████████████\n"
                     "███████▀▀▀░░░░░░░▀▀▀███████\n"
                     "████▀░░░░░░░░░░░░░░░░░▀████\n"
                     "███│░░░░░░░░░░░░░░░░░░░│███\n"
                     "██▌│░░░░░░░░░░░░░░░░░░░│▐██\n"
                     "██░└┐░░░░░░░░░░░░░░░░░┌┘░██\n"
                     "██░░└┐░░░░░░░░░░░░░░░┌┘░░██\n"
                     "██░░┌┘▄▄▄▄▄░░░░░▄▄▄▄▄└┐░░██\n"
                     "██▌░│██████▌░░░▐██████│░▐██\n"
                     "███░│▐███▀▀░░▄░░▀▀███▌│░███\n"
                     "██▀─┘░░░░░░░▐█▌░░░░░░░└─▀██\n"
                     "██▄░░░▄▄▄▓░░▀█▀░░▓▄▄▄░░░▄██\n"
                     "████▄─┘██▌░░░░░░░▐██└─▄████\n"
                     "█████░░▐█─┬┬┬┬┬┬┬─█▌░░█████\n"
                     "████▌░░░▀┬┼┼┼┼┼┼┼┬▀░░░▐████\n"
                     "█████▄░░░└┴┴┴┴┴┴┴┘░░░▄█████\n"
                     "███████▄░░░░░░░░░░░▄███████\n"
                     "██████████▄▄▄▄▄▄▄██████████\n"
                     "███████████████████████████\n")


@ayiinCmd(pattern="wlc(?: |$)(.*)")
async def _(event):
    await event.edit("█▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀█\n"
                     "█░░╦─╦╔╗╦─╔╗╔╗╔╦╗╔╗░░█\n"
                     "█░░║║║╠─║─║─║║║║║╠─░░█\n"
                     "█░░╚╩╝╚╝╚╝╚╝╚╝╩─╩╚╝░░█\n"
                     "█▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄█\n")


@ayiinCmd(pattern="klb(?: |$)(.*)")
async def _(event):
    await event.edit("   ╚⊙ ⊙╝..\n"
                     "   ╚═(███)═╝\n"
                     "    ╚═(███)═╝\n"
                     "       ╚═(███)═╝\n"
                     "        ╚═(███)═╝\n"
                     "        ╚═(███)═╝\n"
                     "        ╚═(███)═╝\n"
                     "      ╚═(███)═╝\n"
                     "     ╚═(███)═╝\n"
                     "    ╚═(███)═╝ \n"
                     "    ╚═(███)═╝\n"
                     "     ╚═(███)═╝\n"
                     "      ╚═(███)═╝\n"
                     "       ╚═(███)═╝\n"
                     "        ╚═(███)═╝\n"
                     "        ╚═(███)═╝\n"
                     "       ╚═(███)═╝\n"
                     "      ╚═(███)═╝\n"
                     "     ╚═(███)═╝\n"
                     "     ╚═(███)═╝\n"
                     "      ╚═(█)═╝\n")


@ayiinCmd(pattern="fucek(?: |$)(.*)")
async def _(event):
    await event.edit("░░░░░░░░░░░░░░░▄▄░░░░░░░░░░░\n"
                     "░░░░░░░░░░░░░░█░░█░░░░░░░░░░\n"
                     "░░░░░░░░░░░░░░█░░█░░░░░░░░░░\n"
                     "░░░░░░░░░░░░░░█░░█░░░░░░░░░░\n"
                     "░░░░░░░░░░░░░░█░░█░░░░░░░░░░\n"
                     "██████▄███▄████░░███▄░░░░░░░\n"
                     "▓▓▓▓▓▓█░░░█░░░█░░█░░░███░░░░\n"
                     "▓▓▓▓▓▓█░░░█░░░█░░█░░░█░░█░░░\n"
                     "▓▓▓▓▓▓█░░░░░░░░░░░░░░█░░█░░░\n"
                     "▓▓▓▓▓▓█░░░░░░░░░░░░░░░░█░░░░\n"
                     "▓▓▓▓▓▓█░░░░░░░░░░░░░░██░░░░░\n"
                     "▓▓▓▓▓▓█████░░░░░░░░░██░░░░░░\n")


cmdHelp.update(
    {
        "ᴀɴɪᴍᴀꜱɪ": f"**ᴘʟᴜɢɪɴ : **`ᴀɴɪᴍᴀꜱɪ`\
        \n\n  »  **ᴘᴇʀɪɴᴛᴀʜ :** `{cmd}skull`\
        \n  »  **ᴋᴇɢᴜɴᴀᴀɴ : **ᴜɴᴛᴜᴋ ᴍᴇᴍᴜɴᴄᴜʟᴋᴀɴ ᴛᴇᴋꜱ ᴀɴɪᴍᴀꜱɪ ᴛᴇɴɢᴋᴏʀᴀᴋ.\
        \n\n  »  **ᴘᴇʀɪɴᴛᴀʜ :** `{cmd}wlc`\
        \n  »  **ᴋᴇɢᴜɴᴀᴀɴ : **ᴜɴᴛᴜᴋ ᴍᴇᴍᴜɴᴄᴜʟᴋᴀɴ ᴛᴇᴋꜱ ᴀɴɪᴍᴀꜱɪ ᴡᴇʟᴄᴏᴍᴇ.\
        \n\n  »  **ᴘᴇʀɪɴᴛᴀʜ :** `{cmd}klb`\
        \n  »  **ᴋᴇɢᴜɴᴀᴀɴ : **ᴜɴᴛᴜᴋ ᴍᴇᴍᴜɴᴄᴜʟᴋᴀɴ ᴛᴇᴋꜱ ᴀɴɪᴍᴀꜱɪ ᴋᴇʟᴀʙᴀɴɢ.\
        \n\n  »  **ᴘᴇʀɪɴᴛᴀʜ :** `{cmd}fucek`\
        \n  »  **ᴋᴇɢᴜɴᴀᴀɴ : **ᴜɴᴛᴜᴋ ᴍᴇᴍᴜɴᴄᴜʟᴋᴀɴ ᴛᴇᴋꜱ ᴀɴɪᴍᴀꜱɪ ᴛᴀɴɢᴀɴ ꜰᴜᴄᴇᴋ.\
        \n\n**ᴋʟᴏ ᴍᴀᴜ ʀᴇQ, ᴋᴏꜱᴀ ᴋᴀᴛᴀ ᴅᴀʀɪ ʟᴜ ʙɪꜱᴀ ᴘᴀᴋᴇ ᴍᴏᴅᴜʟᴇ ᴄᴏꜱᴛᴜᴍ. ᴋᴇᴛɪᴋ** `{cmd}help costum`\
    "
    }
)
